10_Rails_Intro/book_app/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "year_published", "genre", "available", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)